IDENTIFICATION DIVISION.
PROGRAM-ID. FIBO.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N   PIC 9(3).
01 A   PIC 9(5) VALUE 0.
01 B   PIC 9(5) VALUE 1.
01 C   PIC 9(5).
01 I   PIC 9(3).

PROCEDURE DIVISION.
    DISPLAY "How many terms?".
    ACCEPT N.

    DISPLAY A.
    DISPLAY B.

    PERFORM VARYING I FROM 3 BY 1 UNTIL I > N
        COMPUTE C = A + B
        DISPLAY C
        MOVE B TO A
        MOVE C TO B
    END-PERFORM.

    STOP RUN.

